package question;

public class Question {
	/*
	 *  1. 멤버변수를 초기화하는 방법 3가지
	 *   - 명시적 초기화
	 *   - 초기화 블록
	 *   - 생성자를 통한 초기화
	 *   
	 *  2. 오버로딩
	 *   - 이름이 같은 메서드를 여러 개 선언하는 것
	 *   - 매개변수 타입, 갯수가 다른 조건
	 *   
	 *  3. this()
	 *   - 생성자에서 다른 생성자 호출에 사용
	 *   
	 *  4. this
	 *   - 인스턴스 변수와 지역변수의 이름이 같을 때 구분하기 위해 사용
	 *   
	 *  5. static
	 *   - 객체들끼리 공유
	 *   - 객체 생성하지 않고 사용
	 *   
	 *  6. JVM
	 *   - 메소드 에어리어
	 *   - Call Stack
	 *   - Heap
	 *   
	 *  7. 상속
	 *   - 부모클래스에서 자식클래스에 메서드, 변수를 사용하게 해주는 것
	 *   - 초기화블럭과 생성자를 제외한 모든 것을 물려줌
	 *   
	 *  8. 다중상속에 대하여
	 *   - 클래스는 하나의 클래스만 상속 받을 수 있다
	 *   
	 *  9. super()
	 *   - 자식클래스의 생성자에서 부모클래스의 생성자를 호출할 때
	 *  
	 *  10. super
	 *   - 부모클래스의 멤버 변수와 자식클래스의 멤버 변수가 같을 때 구분하기 위해 사용
	 *   
	 *  11. 오버라이딩
	 *   - 부모클래스에서 물려받은 메서드를 재정의하는 것
	 *   - 조건 : 메서드 이름, 리턴타입, 매개변수가 같아야한다
	 *   
	 *  12. 접근제어자
	 *   - public : 접근제한이 없음
	 *   - protected : 같은 패키지, 상속 받은 클래스
	 *   - default : 같은 패키지
	 *   - private : 같은 클래스
	 *   
	 *  13. 추상클래스
	 *   - 추상메서드를 가진 클래스
	 *   - 추상메서드는 선언부만 있고 구현부가 없는 메서드
	 *  
	 *  14. 인터페이스
	 *   - 상수와 추상메서드만 가진 것
	 * 
	 */
}
